'''
Кудрявченко Микола, 141, lab4
9. Дано рядок, що містить принаймні один символ пробілу.
Вивести підстроку, розташовану між першим і останнім пробілом початкового рядка.
Якщо рядок містить тільки один пробіл, то вивести порожний рядок.
'''
print('введіть рядок:')
s = str(input())

def func(s):
    k=0
    for c in s:
        if c == " ":
            k=k+1
    if k==1:
        print(" ")
    elif k==0:
        print("Рядок немає пробілів")
        exit(0)
    else:
        print(s[first:last])

k=0
first=0
last=0
for c in s:
    k=k+1
for j in range(0,k-1, 1):
    if s[j] == " ":
        first=j
        break
for i in range(k-1, 0, -1):
    if s[i]==" ":
        last=i
        break

print('Розташовано між першим і останнім пробілом початкового рядка:')
func(s)
