'''
Кудрявченко Микола, 141, lab4
19. Дано список. Виведіть ті його елементи, які зустрічаються в списку тільки один раз.
Елементи потрібно виводити в тому порядку, в якому вони зустрічаються в списку.
'''
print('Введіть список:')
s = str(input())

def func(s):
    k=0
    for c in s:
        k=k+1
    for i in range(0, k, 1):
        if s.count(s[i]) == 1:
            print(s[i])

print('Елементи, які зустрічаються в списку тільки один раз:')
func(s)