'''
Кудрявченко Микола, 141, lab4
4. Дано непорожній рядок S. Вивести рядок, що містить символи рядка S, між якими вставлено по одному пробілу.
'''
print('Введіть рядрк S:')
s = str(input())

def func(s):
    for i in s:
        print(i, end=" ")
print('рядок, що містить символи рядка S, між якими вставлено по одному пробілу:')
func(s)
