'''
Кудрявченко Микола, 141, lab5
9. Описати функцію AddLeftDigit (D, K), що додає до цілого позитивного числа K ліворуч цифру D
(D - вхідний параметр цілого типу, що лежить в діапазоні 1-9, K - параметр цілого типу,
який є одночасно вхідним і вихідним). За допомогою цієї функції послідовно додати до цього числа K
ліворуч дані цифри D1 і D2, виводячи результат кожного додавання.
'''
print('введіть k:')
k=int(input())
print('введіть d1(від 1 до 9):')
d1=int(input(""))
d2=5

def add_left_digit(d1, d2, k):
    k=int(str(d1) + str(k))
    print(k)
    k=int(str(d2) + str(k))
    print(k)

print('Результати додавання:')
add_left_digit(d1, d2, k)