'''Кудрявченко Микола 141, lab2

9. Мастям гральних карт присвоєно порядкові номери: 1 - піки, 2 - трефи, 3 - бубни, 4 - черви.
Вартості карт, які старші за десятку, привласнені номери: 11 - валет, 12 - дама, 13 - король, 14 - туз.
Дано два цілих числа: N - вартість (6 ≤ N ≤ 14) і M - масть карти (1 ≤ M ≤ 4). Вивести назву
відповідної карти виду «шістка бубон», «дама черв», «туз треф», тощо.'''

print('введіть вартість карти n(6<=N<=14):')
n=int(input())
print('введіть масть карти m(1<=M<=4):')
m=int(input())

if n==6:
    a=str('шістка')
elif n==7:
    a=str('сімка')
elif n==8:
    a=str('вісімка')
elif n==9:
    a=str('девятка')
elif n==10:
    a=str('десятка')
elif n==11:
    a=str('валет')
elif n==12:
    a=str('дама')
elif n==13:
    a=str('король')
elif n==14:
    a=str('туз')
else: print('такої карти не існує')

if m==1:
    b=str('піки')
elif m==2:
    b=str('трефи')
elif m==3:
    b=str('бубни')
elif m==4:
    b=str('черви')
else: print('такої масті не існує')

print('обрана карта:',a ,b)
