'''
Кудрявченко Микола, 141, lab2
14. Дано три різних числа. Знайти, яке з них є середнім (більше одного, але менше іншого).
'''

print('Введіть три числа: ')
a = int(input())
b = int(input())
c = int(input())
if b < a < c or c < a < b:
    print('Середнє:', a)
elif a < b < c or c < b < a:
    print('Середнє:', b)
else:
    print('Середнє:', c)
