'''
Кудрявченко Микола, 141, lab1
10. Дано ціле число в діапазоні 100-999. Вивести рядок-опис даного числа, наприклад: 256 - "двісті
п'ятдесят шість", 814 - "вісімсот чотирнадцять».
'''

print('Введіть ціле число в діапазоні 100-999:')
a=int(input())
if a//100==1:
    s=str('сто')
elif a//100==2:
    s=str('двісті')
elif a//100==3:
    s=str('триста')
elif a//100==4:
    s=str('чотириста')
elif a//100==5:
    s=str('пятсот')
elif a//100==6:
    s=str('шістсот')
elif a//100==7:
    s=str('сімсот')
elif a//100==8:
    s=str('вісімсот')
elif a//100==9:
    s=str('девятсот')
else: print('Введене число не відповідає умові')

m=a%100

if m//10==1 and a%10==1:
    d=str('одинадцять')
elif m//10==1 and a%10==2:
    d=str('дванадцять')
elif m//10==1 and a%10==3:
    d=str('тринадцять')
elif m//10==1 and a%10==4:
    d=str('чотирнадцять')
elif m//10==1 and a%10==5:
    d=str('пятнадцять')
elif m//10==1 and a%10==6:
    d=str('шістнадцять')
elif m//10==1 and a%10==7:
    d=str('сімнадцять')
elif m//10==1 and a%10==8:
    d=str('вісімнадцять')
elif m//10==1 and a%10==9:
    d=str('девятнадцять')
else: 0

if m//10==2:
    d=str('двадцять')
elif m//10==3:
    d=str('тридцять')
elif m//10==4:
    d=str('сорок')
elif m//10==5:
    d=str('пятдесят')
elif m//10==6:
    d=str('шістдесят')
elif m//10==7:
    d=str('сімдесят')
elif m//10==8:
    d=str('вісімдесят')
elif m//10==9:
    d=str('девяносто')
elif m//10==0:
    d=str(' ')
else: print('введене число не відповідає умові')

if m%10==1:
    o=str('один')
elif m%10==2:
    o=str('два')
elif m%10==3:
    o=str('три')
elif m%10==4:
    o=str('чотири')
elif m%10==5:
    o=str('пять')
elif m%10==6:
    o=str('шість')
elif m%10==7:
    o=str('сім')
elif m%10==8:
    o=str('вісім')
elif m%10==9:
    o=str('девять')
elif m%10==0:
    o=str(' ')

print(s ,d ,o)




