'''
Кудрявченко Микола, 141, lab3
9. Дано ціле число N (> 0). Знайти число, отримане при прочитанні числа N справа наліво та добуток його цифр.
'''

print('Введіть ціле число N:')

n = int(input())
n2 = 0
s=0

while n > 0:2
    a = n % 10
    n = n // 10
    s=s+a
    n2 = n2 * 10
    n2 = n2 + a

print("Сума:", s)
print('Число N справа наліво:', n2)


