'''
Кудрявченко Микола, 141, lab3
14. Дано ціле число N (> 0). Знайти добуток N! = 1 • 2 • ... • N (N-факторіал).
Щоб уникнути цілочисельного переповнення, обчислювати цей добуток за допомогою
дійсної змінної і вивести його як дійсне число.
'''

print('Введіть ціле число N(>0):')
n=float(input())
f=1

while n>1:
    f=f*n
    n=n-1
print("факторіал числа N= ",round(f,2))
