'''
Кудрявченко Микола, 141, lab3
19. Дано ціле число N (> 1). Послідовність чисел Фібоначчі FK визначається наступним чином:
F1 = 1, F2 = 1, FK = FK-2 + FK-1, K = 3, 4, .... Перевірити, чи є число N числом Фібоначчі.
Якщо є, то вивести true, якщо ні - вивести false.
'''

print('введіть ціле число N(>1):')
n=int(input())

f=0
f1=1
f2=1

while (f < n) :
        f = f2 + f1
        f2 = f1
        f1 = f
if (f == n):
    print('True')
else:
    print('False')
